In [1]:
import pandas as pd

In [2]:
stocks = pd.read_csv('http://bit.ly/smallstocks')

In [ ]:
# columns:
# Date -- date
# Close -- Closing price for that stock on that day
# Volume -- volumne of traing for that stock on that day.
# Symbol -- stock symbpl. AAPL (Apple), CSCO (cisco), MSFT (microsoft)

In [4]:
stocks  # is a regular index, not a multi-index

         Date   Close    Volume Symbol
0  2016-10-03   31.50  14070500   CSCO
1  2016-10-03  112.52  21701800   AAPL
2  2016-10-03   57.42  19189500   MSFT
3  2016-10-04  113.00  29736800   AAPL
4  2016-10-04   57.24  20085900   MSFT
5  2016-10-04   31.35  18460400   CSCO
6  2016-10-05   57.64  16726400   MSFT
7  2016-10-05   31.59  11808600   CSCO
8  2016-10-05  113.05  21453100   AAPL

In [5]:
# for each company, what is the mean closing price?
stocks.groupby('Symbol').Close.mean()

Symbol
AAPL    112.856667
CSCO     31.480000
MSFT     57.433333
Name: Close, dtype: float64

In [7]:
# Now i'm going to group by two things
# for each pair of symbol and date, what is the mean closing price?
# Using mean here is kind of silly bc there is only one closing price for each symbol and date. 
# If we had two prices, an opening price and a closing price, 
#    we could take the mean of those two. 
# this is a series with a multi-index
stocks.groupby(['Symbol', 'Date']).Close.mean()

Symbol  Date
AAPL    2016-10-03    112.52
        2016-10-04    113.00
        2016-10-05    113.05
CSCO    2016-10-03     31.50
        2016-10-04     31.35
        2016-10-05     31.59
MSFT    2016-10-03     57.42
        2016-10-04     57.24
        2016-10-05     57.64
Name: Close, dtype: float64

In [8]:
# A double group by is a series with a multi-index
# 
ser = stocks.groupby(['Symbol', 'Date']).Close.mean()

In [12]:
ser

Symbol  Date
AAPL    2016-10-03    112.52
        2016-10-04    113.00
        2016-10-05    113.05
CSCO    2016-10-03     31.50
        2016-10-04     31.35
        2016-10-05     31.59
MSFT    2016-10-03     57.42
        2016-10-04     57.24
        2016-10-05     57.64
Name: Close, dtype: float64

In [10]:
ser.index

MultiIndex(levels=[['AAPL', 'CSCO', 'MSFT'], ['2016-10-03', '2016-10-04', '2016-10-05']],
           labels=[[0, 0, 0, 1, 1, 1, 2, 2, 2], [0, 1, 2, 0, 1, 2, 0, 1, 2]],
           names=['Symbol', 'Date'])

In [11]:
ser.index.levels

FrozenList([['AAPL', 'CSCO', 'MSFT'], ['2016-10-03', '2016-10-04', '2016-10-05']])

In [14]:
# unstack a multi-index and it becomes a data frame.
ser.unstack()

Date    2016-10-03  2016-10-04  2016-10-05
Symbol
AAPL        112.52      113.00      113.05
CSCO         31.50       31.35       31.59
MSFT         57.42       57.24       57.64

In [15]:
stocks.groupby(['Symbol', 'Date']).Close.mean().unstack()

Date    2016-10-03  2016-10-04  2016-10-05
Symbol
AAPL        112.52      113.00      113.05
CSCO         31.50       31.35       31.59
MSFT         57.42       57.24       57.64

In [16]:
# the values inside the table are the closing prices, 
#  thus values='Close'
# The indices are the sock symbols
# The columns are the dates
# the default aggregation function for a pivot_table is the mean,
# which is why this is identical to the one above. 
stocks.pivot_table(values='Close', index='Symbol', columns='Date')

Date    2016-10-03  2016-10-04  2016-10-05
Symbol
AAPL        112.52      113.00      113.05
CSCO         31.50       31.35       31.59
MSFT         57.42       57.24       57.64

In [20]:
df = stocks.pivot_table(values='Close', index='Symbol', columns='Date', aggfunc='mean')
df

Date    2016-10-03  2016-10-04  2016-10-05
Symbol
AAPL        112.52      113.00      113.05
CSCO         31.50       31.35       31.59
MSFT         57.42       57.24       57.64

In [17]:
?stocks.pivot_table

Selecting from a multi-index series and data frame

In [21]:
ser

Symbol  Date
AAPL    2016-10-03    112.52
        2016-10-04    113.00
        2016-10-05    113.05
CSCO    2016-10-03     31.50
        2016-10-04     31.35
        2016-10-05     31.59
MSFT    2016-10-03     57.42
        2016-10-04     57.24
        2016-10-05     57.64
Name: Close, dtype: float64

In [22]:
ser.loc['AAPL']

Date
2016-10-03    112.52
2016-10-04    113.00
2016-10-05    113.05
Name: Close, dtype: float64

In [23]:
ser.loc['AAPL', '2016-10-03']

112.52

In [25]:
# all closing prices means for that day
ser.loc[:, '2016-10-03']

Symbol
AAPL    112.52
CSCO     31.50
MSFT     57.42
Name: Close, dtype: float64

In [27]:
ser.AAPL

Date
2016-10-03    112.52
2016-10-04    113.00
2016-10-05    113.05
Name: Close, dtype: float64

In [29]:
df.loc['AAPL']

Date
2016-10-03    112.52
2016-10-04    113.00
2016-10-05    113.05
Name: AAPL, dtype: float64

In [30]:
df.loc['AAPL', '2016-10-03']

112.52

In [31]:
df.loc[:, '2016-10-03']

Symbol
AAPL    112.52
CSCO     31.50
MSFT     57.42
Name: 2016-10-03, dtype: float64

In [32]:
stocks.head()

         Date   Close    Volume Symbol
0  2016-10-03   31.50  14070500   CSCO
1  2016-10-03  112.52  21701800   AAPL
2  2016-10-03   57.42  19189500   MSFT
3  2016-10-04  113.00  29736800   AAPL
4  2016-10-04   57.24  20085900   MSFT

In [33]:
stocks.set_index(['Symbol','Date'], inplace=True)

In [41]:
stocks  # multi-index

                    Close    Volume
Symbol Date
CSCO   2016-10-03   31.50  14070500
AAPL   2016-10-03  112.52  21701800
MSFT   2016-10-03   57.42  19189500
AAPL   2016-10-04  113.00  29736800
MSFT   2016-10-04   57.24  20085900
CSCO   2016-10-04   31.35  18460400
MSFT   2016-10-05   57.64  16726400
CSCO   2016-10-05   31.59  11808600
AAPL   2016-10-05  113.05  21453100

In [42]:
stocks.index

MultiIndex(levels=[['AAPL', 'CSCO', 'MSFT'], ['2016-10-03', '2016-10-04', '2016-10-05']],
           labels=[[1, 0, 2, 0, 2, 1, 2, 1, 0], [0, 0, 0, 1, 1, 1, 2, 2, 2]],
           names=['Symbol', 'Date'])

In [43]:
stocks.sort_index(inplace=True) # sorts by outer index first then the inner index

In [44]:
stocks

                    Close    Volume
Symbol Date
AAPL   2016-10-03  112.52  21701800
       2016-10-04  113.00  29736800
       2016-10-05  113.05  21453100
CSCO   2016-10-03   31.50  14070500
       2016-10-04   31.35  18460400
       2016-10-05   31.59  11808600
MSFT   2016-10-03   57.42  19189500
       2016-10-04   57.24  20085900
       2016-10-05   57.64  16726400

In [45]:
stocks.loc['AAPL']

             Close    Volume
Date
2016-10-03  112.52  21701800
2016-10-04  113.00  29736800
2016-10-05  113.05  21453100

In [48]:
# this works, but it's not the best way
stocks.loc['AAPL', '2016-10-03']

Close          112.52
Volume    21701800.00
Name: (AAPL, 2016-10-03), dtype: float64

In [49]:
# The proper way -- saves headaches. Just trust him. 
stocks.loc[('AAPL', '2016-10-03'), :]

Close          112.52
Volume    21701800.00
Name: (AAPL, 2016-10-03), dtype: float64

In [50]:
stocks.loc[('AAPL', '2016-10-03'), 'Close']

112.52

In [51]:
# Two different stocks on the same day. 
stocks.loc[(['AAPL', 'MSFT'], '2016-10-03'), :]

                    Close    Volume
Symbol Date
AAPL   2016-10-03  112.52  21701800
MSFT   2016-10-03   57.42  19189500

In [52]:
stocks.loc[(['AAPL', 'MSFT'], '2016-10-03'), 'Close']

Symbol  Date
AAPL    2016-10-03    112.52
MSFT    2016-10-03     57.42
Name: Close, dtype: float64

In [54]:
stocks.loc[('AAPL', ['2016-10-03', '2016-10-04']), 'Close']

Symbol  Date
AAPL    2016-10-03    112.52
        2016-10-04    113.00
Name: Close, dtype: float64

In [55]:
stocks.loc[('AAPL', ['2016-10-03', '2016-10-04']), 'Close'].mean()

112.75999999999999

In [56]:
# DOESNT WORK -- must use slice(None) when its the first index.
stocks.loc[(:, ['2016-10-03', '2016-10-04']), 'Close']

SyntaxError: invalid syntax (<ipython-input-56-84f660800ba0>, line 1)

In [57]:
stocks.loc[(slice(None), ['2016-10-03', '2016-10-04']), 'Close']

Symbol  Date
AAPL    2016-10-03    112.52
        2016-10-04    113.00
CSCO    2016-10-03     31.50
        2016-10-04     31.35
MSFT    2016-10-03     57.42
        2016-10-04     57.24
Name: Close, dtype: float64

In [58]:
stocks.loc[(['AAPL', 'MSFT'], '2016-10-03'), :]

                    Close    Volume
Symbol Date
AAPL   2016-10-03  112.52  21701800
MSFT   2016-10-03   57.42  19189500

In [59]:
stocks.loc[(['AAPL', 'MSFT'], '2016-10-03'), slice(None)]

                    Close    Volume
Symbol Date
AAPL   2016-10-03  112.52  21701800
MSFT   2016-10-03   57.42  19189500

In [65]:
close = pd.read_csv('http://bit.ly/smallstocks', usecols=[0,1,3], 
                    index_col=['Symbol', 'Date']).groupby(['Symbol','Date']).mean()
close

                    Close
Symbol Date
AAPL   2016-10-03  112.52
       2016-10-04  113.00
       2016-10-05  113.05
CSCO   2016-10-03   31.50
       2016-10-04   31.35
       2016-10-05   31.59
MSFT   2016-10-03   57.42
       2016-10-04   57.24
       2016-10-05   57.64

In [66]:
volume = pd.read_csv('http://bit.ly/smallstocks', usecols=[0,2,3], 
                    index_col=['Symbol', 'Date']).groupby(['Symbol','Date']).mean()
volume

                     Volume
Symbol Date
AAPL   2016-10-03  21701800
       2016-10-04  29736800
       2016-10-05  21453100
CSCO   2016-10-03  14070500
       2016-10-04  18460400
       2016-10-05  11808600
MSFT   2016-10-03  19189500
       2016-10-04  20085900
       2016-10-05  16726400

In [69]:
?pd.merge

In [71]:
both = pd.merge(close, volume, left_index=True, right_index=True)
both

                    Close    Volume
Symbol Date
AAPL   2016-10-03  112.52  21701800
       2016-10-04  113.00  29736800
       2016-10-05  113.05  21453100
CSCO   2016-10-03   31.50  14070500
       2016-10-04   31.35  18460400
       2016-10-05   31.59  11808600
MSFT   2016-10-03   57.42  19189500
       2016-10-04   57.24  20085900
       2016-10-05   57.64  16726400

In [73]:
both.reset_index()

  Symbol        Date   Close    Volume
0   AAPL  2016-10-03  112.52  21701800
1   AAPL  2016-10-04  113.00  29736800
2   AAPL  2016-10-05  113.05  21453100
3   CSCO  2016-10-03   31.50  14070500
4   CSCO  2016-10-04   31.35  18460400
5   CSCO  2016-10-05   31.59  11808600
6   MSFT  2016-10-03   57.42  19189500
7   MSFT  2016-10-04   57.24  20085900
8   MSFT  2016-10-05   57.64  16726400